//学校字段
var schools = [{
  "name": "上海理工大学",
  "id": "010000000"
}]

var canteens = {
  "010000000":[
    //第一食堂
    {
      "school": "上海理工大学",
      "name": "第一食堂",
      "id": "011010000"
    },

    //第二食堂
    {
      "school": "上海理工大学",
      "name": "第二食堂",
      "id": "011020000"
    },
  ],
}

var floors = {
  "011010000": [
    //一食堂一楼
    {
      "canteens": "第一食堂",
      "name": "一楼",
      "id": "011010100"
    },
    //一食堂二楼
    {
      "canteens": "第一食堂",
      "name": "二楼",
      "id": "011010200"
    },
  ],

  "011020000": [
    {
      //二食堂一楼
      "canteens": "第二食堂",
      "name": "一楼",
      "id": "011020100"
    },
    {
      //二食堂二楼
      "canteens": "第二食堂",
      "name": "二楼",
      "id": "011020200"
    },
  ],
}

var windows = {
  "011010100": [
    {
      //一食堂一楼，一号窗口
      "floors": "一楼",
      "name": "一号窗口",
      "id": "011010101"
    },
    
  ],

  "011010200": [
    {
      //一食堂二楼，一号窗口
      "floors": "二楼",
      "name": "一号窗口",
      "id": "011010201"
    },
    {
      //一食堂二楼，二号窗口
      "floors": "二楼",
      "name": "二号窗口",
      "id": "011010202"
    },
  ],
}


module.exports = {
  schools, //学校
  canteens, //食堂
  floors, //楼层
  windows //窗口号码
}