var schools = [{
  "name": "上海理工大学",
  "id": "010000000"
}]

var dorms = {
  "010000000": [
    {
      //三公一 
      "school": "上海理工大学",
      "name": "三公寓一号楼",
      "id": "010010000"
    },
    {
      //三公二
      "school": "上海理工大学",
      "name": "三公寓二号楼",
      "id": "010020000"
    },
    {
      //三公三
      "school": "上海理工大学",
      "name": "三公寓三号楼",
      "id": "010030000"
    },
  ]
}

var floors = {
  "010010000": [
    {
      //三公一，一楼
      "dorms": "三公寓一号楼",
      "name": "一楼",
      "id": "010010100"
    },
    {
      //三公一，二楼
      "dorms": "三公寓一号楼",
      "name": "二楼",
      "id": "010010200"
    },
  ],
  "010020000": [
    {
      //三公二，一楼
      "dorms": "三公寓二号楼",
      "name": "一楼",
      "id": "010020100"
    },
    {
      //三公二，二楼
      "dorms": "三公寓二号楼",
      "name": "二楼",
      "id": "010020200"
    },
  ],
  "010030000": [
    {
      //三公三，一楼
      "dorms": "三公寓三号楼",
      "name": "一楼",
      "id": "010030100"
    },
    {
      //三公三，二楼
      "dorms": "三公寓三号楼",
      "name": "二楼",
      "id": "010030200"
    },
  ],
}

var rooms = {
  "010010100": [
    {
      //三公一，一楼，101
      "dorm":"三公寓一号楼",
      "floor": "一楼",
      "name": "01寝室",
      "id": "010010101"
    },
    {
      //三公一，一楼，102
      "dorm": "三公寓一号楼",
      "floor": "一楼",
      "name": "02寝室",
      "id": "010010102"
    },
    {
      //三公一，一楼，103
      "dorm": "三公寓一号楼",
      "floor": "一楼",
      "name": "03寝室",
      "id": "010010103"
    },
  ],

  "010010200": [
    {
      //三公一，二楼，201
      "dorm": "三公寓一号楼",
      "floor": "二楼",
      "name": "01寝室",
      "id": "010010201"
    },
    {
      //三公一，二楼，202
      "dorm": "三公寓一号楼",
      "floor": "二楼",
      "name": "02寝室",
      "id": "010010202"
    },
    {
      //三公一，二楼，203
      "dorm": "三公寓一号楼",
      "floor": "二楼",
      "name": "03寝室",
      "id": "010010203"
    },
  ],

  "010020100": [
    {
      //三公二，一楼，101
      "dorm": "三公寓二号楼",
      "floor": "一楼",
      "name": "01寝室",
      "id": "010020101"
    },
    {
      //三公二，一楼，102
      "dorm": "三公寓二号楼",
      "floor": "一楼",
      "name": "02寝室",
      "id": "010020102"
    },
    {
      //三公二，一楼，103
      "dorm": "三公寓二号楼",
      "floor": "一楼",
      "name": "03寝室",
      "id": "010020103"
    },
  ],

  "010020200": [
    {
      //三公二，二楼，201
      "dorm": "三公寓二号楼",
      "floor": "二楼",
      "name": "01寝室",
      "id": "010020201"
    },
    {
      //三公二，二楼，202
      "dorm": "三公寓二号楼",
      "floor": "二楼",
      "name": "02寝室",
      "id": "010020202"
    },
    {
      //三公二，二楼，203
      "dorm": "三公寓二号楼",
      "floor": "二楼",
      "name": "03寝室",
      "id": "010020203"
    },
  ],

  "010030100": [
    {
      //三公三，一楼，101
      "dorm": "三公寓三号楼",
      "floor": "一楼",
      "name": "01寝室",
      "id": "010030101"
    },
    {
      //三公三，一楼，102
      "dorm": "三公寓三号楼",
      "floor": "一楼",
      "name": "02寝室",
      "id": "010030102"
    },
    {
      //三公三，一楼，103
      "dorm": "三公寓三号楼",
      "floor": "一楼",
      "name": "03寝室",
      "id": "010030103"
    },
  ],

  "010030200": [
    {
      //三公三，二楼，201
      "dorm": "三公寓三号楼",
      "floor": "二楼",
      "name": "01寝室",
      "id": "010030201"
    },
    {
      //三公三，二楼，202
      "dorm": "三公寓三号楼",
      "floor": "二楼",
      "name": "02寝室",
      "id": "010030202"
    },
    {
      //三公三，二楼，203
      "dorm": "三公寓三号楼",
      "floor": "二楼",
      "name": "03寝室",
      "id": "010030203"
    },
  ],
}

module.exports = {
  schools, //学校
  dorms, //宿舍楼
  floors, //楼层
  rooms //寝室房间号
}